print("""
      ⠀⠀⠀⠀⠀⠀⢀⣠⣤⡶⠶⠾⠿⠿⠿⠶⢶⣦⣄⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣠⡾⠛⠉⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠛⠷⣦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⣰⡟⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠻⣦⡀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⣼⠏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⣷⡀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⢰⡏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠸⣧⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⢸⠇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⢸⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⢸⡆⢸⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡘⠀⣿⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⢸⣇⣸⠇⢀⣤⣶⣿⣷⣦⣄⠀⠀⠀⠀⢀⣴⣶⣿⣶⣦⡀⠀⣧⣰⣿⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠘⣿⡇⢀⣾⣿⣿⣿⣿⣿⣿⡇⠀⠀⠰⣿⣿⣿⣿⣿⣿⣿⡄⠸⣿⠇⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⣿⠁⠘⣿⣿⣿⣿⣿⡿⠋⠀⠀⠀⠀⠙⠿⣿⣿⣿⣿⣿⠇⠀⢿⡀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⣿⡀⠀⠈⠙⠛⠋⠁⠀⠀⣠⣿⢸⣆⠀⠀⠀⠉⠛⠛⠁⠀⠀⣾⡇⠀⠀⠀⠀⠀⠀
⠀⠀⢀⣤⣤⣤⣄⣻⣷⣤⣀⢀⣀⡄⠀⠀⠀⠻⠟⠸⠿⠀⠀⠀⠀⣄⡀⣀⣠⣼⡿⣠⣤⣤⣤⡀⠀⠀
⠀⢀⣾⡿⠀⠀⠘⢷⣌⠛⠛⠛⢻⡀⢰⠀⢤⠀⢀⡀⠀⣤⠀⢦⠀⡟⠛⠛⠛⢉⣾⠏⠀⠀⢹⣿⡄⠀
⣴⡟⠋⠀⠀⠀⠀⠈⠻⣷⣄⠀⠘⣧⣼⠀⢸⠀⠘⡇⠀⢣⠀⢸⣰⡇⠀⢀⣴⠟⠁⠀⠀⠀⠀⠙⠻⣷
⠻⣧⣕⣦⣤⣤⡤⢤⣀⠀⠙⠻⣦⣝⠿⣦⣼⣄⣠⣇⣀⣼⣴⡿⣛⣴⠾⠋⠁⢀⡠⢤⣤⣤⣤⣔⣴⡿
⠀⠈⠉⠉⠉⠛⠛⠿⣶⣽⣶⣤⡀⠉⠛⠶⣬⣉⠉⠉⢉⣡⡴⠞⠋⢁⣠⣴⣾⣷⠾⠟⠛⠉⠉⠉⠁⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠛⠿⣿⣷⡢⣄⡈⣙⣷⠶⠋⠁⣀⣤⣶⣿⠿⠛⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢉⣻⡿⠟⠋⢀⣠⣴⣾⣿⣿⣋⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⢀⣀⣠⡴⠾⠋⠁⠀⢀⣴⣿⢿⣯⣁⠀⠈⠙⠳⢦⣤⣀⣀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⣴⡿⠛⠉⠁⠀⠀⣀⣴⡾⠛⠉⠀⠀⠈⠛⠿⣦⣄⡀⠀⠀⠉⠙⠻⣶⡀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⣿⣦⡄⠀⠀⣠⡾⠋⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⢿⣦⠀⠀⢀⣤⣿⠇⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠹⣷⣤⣤⡿⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢻⣧⣤⣼⠟⠁⠀⠀⠀⠀⠀⠀
⣀⣀   ☠️  ☠️  ☠️    DEADLY ISLAND   ☠️  ☠️  ☠️   ⢀⣀⡀⠀⠀⠀⠀⠀⠀⠀⠀
      """)

print("""
      Welcome to my Deadly Island!
      There are two doors in front of you: a Red Door 🚪 and a Blue Door 🚪
      """)

door_chosen = input("Which door will you open. Red Door and Blue Door: ").lower()

if door_chosen == "blue":
  print("""
        Oops! You chose the Crocodile Door!
        Game Over! 🐊 🐊 🐊
        """)
  
elif door_chosen == "red":
  print("""
        Great! You entered a room.
        You found three boxes: White Box 🎁, Black Box 🎁 and Green Box 🎁
        """)
  
  box_chosen = input("Which box will you open: ").lower()
  
  if box_chosen == "white":
    print("""
        Oops! You chose the Snake Box!
        Game Over! 🐍 🐍 🐍
        """)
    
  elif box_chosen == "black":
    print("""
        Oops! You chose the Spider Box!
        Game Over! 🕷️  🕷️  🕷️
        """)
    
  elif box_chosen == "green":
    print("""
          Congratulations! You found the Treasure  💰  and the Key  🗝️   to Escape the Deadly Island
          Now, there are five doors in front of you: Yellow Door 🚪, Purple Door 🚪, Grey Door 🚪, Orange Door 🚪, Pink Door 🚪.
          """)
    
    escaping_door_chosen = input("Which Door will you open: ").lower()
    
    if escaping_door_chosen == "yellow" or escaping_door_chosen == "purple" or escaping_door_chosen == "orange" or escaping_door_chosen == "pink":
      print("""
            Oops! You chose the Hole Door!
            Game Over! 🕳️  🕳️  🕳️
            """)
      
    elif escaping_door_chosen == "grey":
      print("""
            Congratulations! You found the Escaping Door.
            You Escaped from the Deadly Island!
            """)
    
    else:
      print("Invalid Choice 🤷  🤷  🤷")
    
  else:
    print("Invalid Choice 🤷  🤷  🤷")
  
else:
  print("Invalid Choice 🤷  🤷  🤷")